case_setup/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  vX.X (fill in version if needed)       |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (-8.221736750335065 -0.5 0.05) // vertex 0
    (-8.221736750335065 0.0 0.05) // vertex 1
    (-4.221736750335065 0.0 0.05) // vertex 2
    (-3.0 0.0 0.05) // vertex 3
    (-3.0 -0.5 0.05) // vertex 4
    (0.0 0.0 0.05) // vertex 5
    (0.5000000000000001 -0.5 0.05) // vertex 6
    (0.7071067811865475 0.0 0.05) // vertex 7
    (1.2071067811865475 -0.5 0.05) // vertex 8
    (4.035533905932738 -3.3284271247461903 0.05) // vertex 9
    (3.3284271247461903 -3.3284271247461903 0.05) // vertex 10
    (-1.767766952966369 2.474873734152917 0.05) // vertex 11
    (-2.121320343559643 2.121320343559643 0.05) // vertex 12
    (-4.14805029709527 1.7181786904626066 0.05) // vertex 13
    (-4.609990063350913 1.9095204066451517 0.05) // vertex 14
    (-3.871194966430465 0.3565395598485258 0.05) // vertex 15
    (-3.4706647233622783 0.092583907883321 0.05) // vertex 16
    (-3.660045583107577 -0.3701632044384431 0.05) // vertex 17
    (-4.242640687119286 1.2426406871192852 0.05) // vertex 18
    (-4.742640687119286 1.2426406871192852 0.05) // vertex 19
    (-3.4706647233622783 2.392697466355249 0.05) // vertex 20
    (-3.660045583107577 2.8554445786770133 0.05) // vertex 21
    (-3.0 2.4852813742385704 0.05) // vertex 22
    (-3.0 2.9852813742385704 0.05) // vertex 23
    (-2.524461996656678 2.3906909842145545 0.05) // vertex 24
    (-2.3331202804741333 2.852630750470198 0.05) // vertex 25
    (-8.221736750335065 -0.5 -0.05) // vertex 26
    (-8.221736750335065 0.0 -0.05) // vertex 27
    (-4.221736750335065 0.0 -0.05) // vertex 28
    (-3.0 0.0 -0.05) // vertex 29
    (-3.0 -0.5 -0.05) // vertex 30
    (0.0 0.0 -0.05) // vertex 31
    (0.5000000000000001 -0.5 -0.05) // vertex 32
    (0.7071067811865475 0.0 -0.05) // vertex 33
    (1.2071067811865475 -0.5 -0.05) // vertex 34
    (4.035533905932738 -3.3284271247461903 -0.05) // vertex 35
    (3.3284271247461903 -3.3284271247461903 -0.05) // vertex 36
    (-1.767766952966369 2.474873734152917 -0.05) // vertex 37
    (-2.121320343559643 2.121320343559643 -0.05) // vertex 38
    (-4.14805029709527 1.7181786904626066 -0.05) // vertex 39
    (-4.609990063350913 1.9095204066451517 -0.05) // vertex 40
    (-3.871194966430465 0.3565395598485258 -0.05) // vertex 41
    (-3.4706647233622783 0.092583907883321 -0.05) // vertex 42
    (-3.660045583107577 -0.3701632044384431 -0.05) // vertex 43
    (-4.242640687119286 1.2426406871192852 -0.05) // vertex 44
    (-4.742640687119286 1.2426406871192852 -0.05) // vertex 45
    (-3.4706647233622783 2.392697466355249 -0.05) // vertex 46
    (-3.660045583107577 2.8554445786770133 -0.05) // vertex 47
    (-3.0 2.4852813742385704 -0.05) // vertex 48
    (-3.0 2.9852813742385704 -0.05) // vertex 49
    (-2.524461996656678 2.3906909842145545 -0.05) // vertex 50
    (-2.3331202804741333 2.852630750470198 -0.05) // vertex 51
);

blocks
(
    hex (26 30 28 27 0 4 2 1) (20 20 1) simpleGrading (1 1 1) // block 0
    hex (30 32 31 29 4 6 5 3) (20 20 1) simpleGrading (1 1 1) // block 1
    hex (32 34 33 31 6 8 7 5) (20 20 1) simpleGrading (1 1 1) // block 2
    hex (36 35 34 32 10 9 8 6) (20 20 1) simpleGrading (1 1 1) // block 3
    hex (31 33 37 38 5 7 11 12) (20 20 1) simpleGrading (1 1 1) // block 4
    hex (48 38 37 49 22 12 11 23) (20 20 1) simpleGrading (1 1 1) // block 5
    hex (40 39 48 49 14 13 22 23) (20 20 1) simpleGrading (1 1 1) // block 6
    hex (28 41 39 40 2 15 13 14) (20 20 1) simpleGrading (1 1 1) // block 7
    hex (30 29 41 28 4 3 15 2) (20 20 1) simpleGrading (1 1 1) // block 8
);

edges
(

arc 15 13 (-4.242640687119286 1.2426406871192852 0.05) // edge 0
arc 2 14 (-4.742640687119286 1.2426406871192852 0.05) // edge 1
arc 3 15 (-3.4706647233622783 0.092583907883321 0.05) // edge 2
arc 4 2 (-3.660045583107577 -0.3701632044384431 0.05) // edge 3
arc 13 22 (-3.4706647233622783 2.392697466355249 0.05) // edge 4
arc 14 23 (-3.660045583107577 2.8554445786770133 0.05) // edge 5
arc 22 12 (-2.524461996656678 2.3906909842145545 0.05) // edge 6
arc 23 11 (-2.3331202804741333 2.852630750470198 0.05) // edge 7
arc 41 39 (-4.242640687119286 1.2426406871192852 -0.05) // edge 8
arc 28 40 (-4.742640687119286 1.2426406871192852 -0.05) // edge 9
arc 29 41 (-3.4706647233622783 0.092583907883321 -0.05) // edge 10
arc 30 28 (-3.660045583107577 -0.3701632044384431 -0.05) // edge 11
arc 39 48 (-3.4706647233622783 2.392697466355249 -0.05) // edge 12
arc 40 49 (-3.660045583107577 2.8554445786770133 -0.05) // edge 13
arc 48 38 (-2.524461996656678 2.3906909842145545 -0.05) // edge 14
arc 49 37 (-2.3331202804741333 2.852630750470198 -0.05) // edge 15

);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 27 26)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (9 10 36 35)
        );
    }
    pipe
    {
        type wall;
        faces
        (
            (4 0 26 30)
            (6 4 30 32)
            (10 6 32 36)
            (8 9 35 34)
            (7 8 34 33)
            (11 7 33 37)
            (23 11 37 49)
            (14 23 49 40)
            (2 14 40 28)
            (1 2 28 27)
            (31 29 3 5)
            (38 31 5 12)
            (48 38 12 22)
            (39 48 22 13)
            (41 39 13 15)
            (29 41 15 3)
        );
    }
);


